Repository: Barath-j593/travel_tracker
Catalog: lib/l10n/app_*.arb
Languages: ml

# appTitle
source: Travel Tracker
ml: ട്രാവൽ ട്രാക്കർ

# appSubtitle
source: Track your journeys, earn eco-points
ml: നിങ്ങളുടെ യാത്രകൾ ട്രാക്ക് ചെയ്യുക, ഇക്കോ പോയിന്റ് നേടുക

# gpsConsentTitle
source: GPS Location Usage Consent
ml: ജിപിഎസ് സ്ഥാനം ഉപയോഗിക്കുന്നതിന് അംഗീകാരം

# gpsConsentDescription
source: Travel Tracker uses your GPS location to enable trip tracking and family safety features. Your location data is securely stored using industry-standard encryption to protect your privacy. We are committed to safeguarding your information and will not share it without your consent.
ml: ട്രാവൽ ട്രാക്കർ നിങ്ങളുടെ യാത്രാ ട്രാക്കിംഗിനും കുടുംബ സുരക്ഷാ സവിശേഷതകൾക്കും നിങ്ങളുടെ ജിപിഎസ് സ്ഥാനം ഉപയോഗിക്കുന്നു. നിങ്ങളുടെ സ്ഥിതി വിവരങ്ങൾ സുരക്ഷിതമായി സൂക്ഷിക്കപ്പെടുന്നു, സുരക്ഷിത എൻക്രിപ്ഷൻ ഉപയോഗിച്ച് സംരക്ഷിക്കുന്നു. നിങ്ങളുടെ സമ്മതം ഇല്ലാതെ ഞങ്ങൾ പങ്കിടുകയില്ല.

# gpsConsentCheckbox
source: I agree to allow Travel Tracker to use my GPS location for trip tracking and family safety features.
ml: യാത്രാ ട്രാക്കിംഗിനും കുടുംബ സുരക്ഷയ്ക്കും എന്റെ ജിപിഎസ് സ്ഥാനം ഉപയോഗിക്കാൻ Travel Tracker അനുവദിക്കുന്നതിന് ഞാൻ സമ്മതിക്കുന്നു.

# gpsConsentRequired
source: Please agree to GPS location usage to proceed.
ml: തുടരാൻ ജിപിഎസ് സ്ഥാനം ഉപയോഗത്തിന് സമ്മതിക്കുക.

source: OK
ml: ശരി

# loginFailed
source: Login failed. Please try again.
ml: ലോഗിൻ പരാജയപ്പെട്ടു. ദയവായി വീണ്ടും ശ്രമിക്കുക.

source: Create Account
ml: അക്കൗണ്ട് സൃഷ്ടിക്കുക

source: Email
ml: ഇമെയിൽ

source: Phone Number
ml: ഫോൺ നമ്പർ

source: Aadhaar Number
ml: ആധാർ നമ്പർ

source: Password
ml: പാസ്‌വേഡ്

source: Confirm Password
ml: പാസ്‌വേഡ് സ്ഥിരീകരിക്കുക

# enterEmail
source: Please enter your email
ml: ദയവായി നിങ്ങളുടെ ഇമെയിൽ നൽകുക

# invalidEmail
source: Please enter a valid email
ml: ദയവായി സാധുവായ ഇമെയിൽ നൽകുക

# enterPhone
source: Please enter a phone number
ml: ദയവായി ഫോൺ നമ്പർ നൽകുക

# invalidPhone
source: Please enter a valid phone number
ml: ദയവായി ശരിയായ ഫോൺ നമ്പർ നൽകുക

# enterAadhaar
source: Please enter your Aadhaar number
ml: ദയവായി നിങ്ങളുടെ ആധാർ നമ്പർ നൽകുക

# invalidAadhaar
source: Aadhaar must be 12 digits
ml: ആധാർ 12 അക്കങ്ങൾ ഉണ്ടായിരിക്കണം

# enterPassword
source: Please enter a password
ml: ദയവായി പാസ്‌വേഡ് നൽകുക

# passwordLength
source: Password must be at least 6 characters
ml: പാസ്‌വേഡ് കുറഞ്ഞത് 6 അക്കങ്ങൾ വേണം

# confirmPasswordText
source: Please confirm your password
ml: ദയവായി പാസ്‌വേഡ് സ്ഥിരീകരിക്കുക

# passwordMismatch
source: Passwords do not match
ml: പാസ്‌വേഡുകൾ പൊരുത്തപ്പെടുന്നില്ല

# registrationSuccess
source: Registration successful! Please login.
ml: രജിസ്ട്രേഷൻ വിജയിച്ചു! ദയവായി ലോഗിൻ ചെയ്യുക.

# alreadyHaveAccount
source: Already have an account? Login
ml: ഇപ്പോൾ അക്കൗണ്ട് ഉണ്ടോ? ലോഗിൻ ചെയ്യുക

source: Register
ml: രജിസ്ട്രർ ചെയ്യുക

source: Login
ml: ലോഗിൻ

source: Demo Credentials:
ml: ഡെമോ ക്രെഡൻഷ്യൽസ്:

source: Admin
ml: അഡ്മിൻ

source: Admin Dashboard
ml: അഡ്മിൻ ഡാഷ്ബോർഡ്

# searchPlace
source: Search for a place...
ml: സ്ഥലം തിരയുക...

# statisticsFor
source: Statistics for: {place}
ml: {place}യുടെ സ്ഥിതിവിവരക്കണക്കുകൾ

source: Total Users
ml: ആകെ ഉപയോക്താക്കൾ

source: Total Trips
ml: മൊത്തം യാത്രകൾ

source: Avg. Trips/User
ml: ശരാശരി യാത്രകൾ/ഉപയോക്താവ്

source: Active Today
ml: ഇന്ന് സജീവം

# transportModeShare
source: Transport Mode Share - {place}
ml: ഗതാഗത രീതിയുടെ പങ്ക് - {place}

# weeklyTripCount
source: Weekly Trip Count - {place}
ml: ആഴ്ചയിലെ യാത്രാ കണക്ക് - {place}

source: Users by Place
ml: സ്ഥലംപ്രകാരം ഉപയോക്താക്കൾ

# tripsPoints
source: {trips} trips • {points} points
ml: {trips} യാത്രകൾ • {points} പോയിന്റുകൾ

# autoTripDetection
source: Automatic Trip Detection
ml: ഓട്ടോമാറ്റിക് യാത്ര കണ്ടെത്തൽ

# detectionActive
source: AUTOMATIC DETECTION ACTIVE
ml: ഓട്ടോമാറ്റിക് കണ്ടെത്തൽ പ്രവർത്തിക്കുന്നു

source: DETECTION PAUSED
ml: കണ്ടെത്തൽ നിർത്തി

# monitoringMovements
source: Monitoring your movements...
ml: നിങ്ങളുടെ ചലനങ്ങൾ നിരീക്ഷിക്കുന്നു...

# detectionPausedText
source: Detection paused
ml: കണ്ടെത്തൽ നിർത്തി

source: TRIP IN PROGRESS
ml: യാത്ര പുരോഗമിക്കുന്നു

source: Duration
ml: കാലാവധി

source: Distance
ml: ദൂരം

source: Mode
ml: മോഡ്

# detectedAutomatically
source: Detected automatically based on your movement patterns
ml: നിങ്ങളുടെ ചലന പാറ്റേണുകൾ അടിസ്ഥാനമാക്കി സ്വയം കണ്ടെത്തി

source: Trip Detection Active
ml: യാത്ര കണ്ടെത്തൽ സജീവമാണ്

source: Monitoring Movement
ml: ചലനം നിരീക്ഷിക്കുന്നു

# trackingJourney
source: Tracking your journey automatically
ml: നിങ്ങളുടെ യാത്ര സ്വയം പിന്തുടരുന്നു

# waitingMovement
source: Waiting for significant movement...
ml: പ്രധാനപ്പെട്ട ചലനത്തിനായി കാത്തിരിക്കുന്നു...

source: End Trip Now
ml: യാത്ര അവസാനിപ്പിക്കുക

# howDetectionWorks
source: How automatic detection works:
ml: ഓട്ടോമാറ്റിക് കണ്ടെത്തൽ എങ്ങനെ പ്രവർത്തിക്കുന്നു:

# howDetectionPoints
source: • Detects movement patterns using GPS and sensors • Automatically identifies transport mode • Starts tracking when significant movement is detected • Respects privacy settings and battery optimization
ml: • GPS, സെൻസറുകൾ ഉപയോഗിച്ച് ചലനങ്ങൾ കണ്ടെത്തുന്നു • ഗതാഗത മോഡ് സ്വയം തിരിച്ചറിയുന്നു • പ്രധാനപ്പെട്ട ചലനം കണ്ടെത്തുമ്പോൾ ട്രാക്കിംഗ് ആരംഭിക്കുന്നു • സ്വകാര്യതയും ബാറ്ററി ഒപ്റ്റിമൈസേഷനും മാനിക്കുന്നു

source: Trip Completed
ml: യാത്ര പൂർത്തിയായി

# autoTripDetectionTitle
source: Automatic Trip Detection
ml: സ്വയം യാത്ര കണ്ടെത്തൽ

# detectionInfo
source: How automatic detection works:
ml: സ്വയം കണ്ടെത്തൽ എങ്ങനെ പ്രവർത്തിക്കുന്നു:

source: Travel Companions
ml: യാത്രാസുഹൃത്തുകൾ

source: Add New Companion
ml: പുതിയ യാത്രാസുഹൃത്ത് ചേർക്കുക

source: Name
ml: പേര്

# enterName
source: Please enter a name
ml: ദയവായി പേര് നൽകുക

source: Add Companion
ml: യാത്രാസുഹൃത്ത് ചേർക്കുക

source: Your Companions
ml: നിങ്ങളുടെ യാത്രാസുഹൃത്തുകൾ

# noCompanions
source: No companions added yet
ml: ഇനിയും സുഹൃത്തുക്കൾ ചേർത്തിട്ടില്ല

# companionAdded
source: Companion added successfully
ml: യാത്രാസുഹൃത്ത് വിജയകരമായി ചേർത്തു

source: Companion removed
ml: യാത്രാസുഹൃത്ത് നീക്കം ചെയ്തു

# ecoPointsTitle
source: Eco Points & Rewards
ml: ഇക്കോ പോയിന്റ്സ് & റിവാർഡുകൾ

# pointsTab
source: Points
ml: പോയിന്റ്സ്

# rewardsTab
source: Rewards
ml: റിവാർഡുകൾ

source: TOTAL ECO POINTS
ml: മൊത്തം ഇക്കോ പോയിന്റ്സ്

# pointsToNextLevel
source: {points} points to next level
ml: {points} പോയിന്റ്സ് അടുത്ത ലെവലിന്

# levelLabel
source: Level {level} • Eco Warrior
ml: ലെവൽ {level} • ഇക്കോ വാരിയർ

source: ACHIEVEMENTS & BADGES
ml: സാധ്യമായ നേട്ടങ്ങളും ബാഡ്ജുകളും

source: Available Rewards
ml: ലഭ്യമായ റിവാർഡുകൾ

# rewardsCount
source: {count} rewards
ml: {count} റിവാർഡുകൾ

source: Redeemed Rewards
ml: റിഡീം ചെയ്ത റിവാർഡുകൾ

# itemsCount
source: {count} items
ml: {count} ഐറ്റങ്ങൾ

# noRedeemedRewards
source: No redeemed rewards yet
ml: എന്നിവിടെ റിഡീം ചെയ്ത റിവാർഡുകൾ ഒന്നുമില്ല

source: Redeem
ml: റിഡീം ചെയ്യുക

# needMorePoints
source: Need {points} more
ml: {points} കൂടുതൽ പോയിന്റ്സ് ആവശ്യമാണ്

# redeemRewardTitle
source: Redeem Reward?
ml: റിവാർഡ് റിഡീം ചെയ്യണോ?

# redeemRewardDescription
source: Redeem {rewardName} for {points} eco points?
ml: {rewardName} റിഡീം ചെയ്യാൻ {points} ഇക്കോ പോയിന്റ്സ് ഉപയോക്താക്കുക?

source: Cancel
ml: റദ്ദാക്കുക

# redeemConfirm
source: Redeem
ml: റിഡീം ചെയ്യുക

# redeemSuccess
source: {rewardName} redeemed successfully!
ml: {rewardName} വിജയകരമായി റിഡീം ചെയ്തു!

source: Eco Starter
ml: ഇക്കോ സ്റ്റാർട്ടർ

source: Bus Commuter
ml: ബസ് യാത്രികൻ

source: Bike Enthusiast
ml: ബൈക്ക് ആസ്വാദകൻ

source: Weekly Goal
ml: വാരാന്ത്യ ലക്ഷ്യം

source: Monthly Goal
ml: മാസാന്ത്യ ലക്ഷ്യം

source: Carbon Saver
ml: കാർബൺ സേവർ

# familyLocationTitle
source: Family Location
ml: കുടുംബ സ്ഥലം

source: Locations updated
ml: സ്ഥലങ്ങൾ അപ്‌ഡേറ്റ് ചെയ്തു

# familySafetyTitle
source: Family Safety
ml: കുടുംബ സുരക്ഷ

# familySafetySubtitle
source: Real-time location sharing with consent
ml: അനുമതിയോടെ സതതസ്ഥല പങ്കിടൽ

# familyMapViewTitle
source: Family Map View
ml: കുടുംബ മാപ്പ് കാഴ്ച

# familyMapViewSubtitle
source: {memberCount} family members visible
ml: {memberCount} കുടുംബാംഗങ്ങൾ കാണുന്നു

# familyMembersHeader
source: FAMILY MEMBERS
ml: കുടുംബാംഗങ്ങൾ

# onlineLabel
source: Online
ml: ഓൺലൈൻ

# offlineLabel
source: Offline
ml: ഓഫ്ലൈൻ

# relationWife
source: Wife
ml: ഭാര്യ

# relationSon
source: Son
ml: മകന്‍

# relationDaughter
source: Daughter
ml: മകൾ

# relationFather
source: Father
ml: പിതാവ്

# travelTrackerTitle
source: Travel Tracker
ml: യാത്രാ ട്രാക്കർ

# dashboardLabel
source: DASHBOARD
ml: ഡാഷ്ബോർഡ്

# welcomeSubtitle
source: Automatic trip detection • Eco points • Family safety
ml: സ്വയം ട്രിപ്പ് കണ്ടെത്തൽ • ഇക്കോ പോയിന്റ് • കുടുംബ സുരക്ഷ

# menuAutoTripDetection
source: Auto Trip Detection
ml: സ്വയം ട്രിപ്പ് കണ്ടെത്തൽ

# menuTripHistory
source: Trip History
ml: ട്രിപ്പ് ചരിത്രം

# menuEcoPoints
source: Eco Points
ml: ഇക്കോ പോയിന്റ്

# menuFamilyLocation
source: Family Location
ml: കുടുംബ സ്ഥലം

# menuCompanions
source: Companions
ml: കമ്പാനിയൻസ്

# menuMonthlySummary
source: Monthly Summary
ml: മാസാന്ത സംഗ്രഹം

# menuAdminDashboard
source: Admin Dashboard
ml: അഡ്മിൻ ഡാഷ്ബോർഡ്

# profileTooltip
source: Profile
ml: പ്രൊഫൈൽ

# monthlySummaryTitle
source: Monthly Summary
ml: മാസാന്ത്യ സമാരി

source: Distance by Transport Mode
ml: ഗതാഗത മാർഗ്ഗപ്രകാരം ദൂരം

# co2Saved
source: CO2 Saved (kg)
ml: CO2 ലാഭിച്ചിരിക്കുന്നു (കീ.ജീ.)

source: Monthly Stats
ml: മാസാന്ത്യ സ്ഥിതിവിവരങ്ങൾ

source: Total Distance
ml: മൊത്തം ദൂരം

# co2SavedStat
source: CO2 Saved
ml: CO2 ലാഭിച്ചിരിക്കുന്നു

source: Trips Taken
ml: യാത്രകളുടെ എണ്ണം

source: Eco Points
ml: ഇക്കോ പോയിന്റ്സ്

source: Car
ml: കാർ

source: Bus
ml: ബസ്

source: Bike
ml: ബൈക്ക്

source: Walk
ml: നടപ്പ്

source: Jan
ml: ജനു

source: Feb
ml: ഫെബ്രു

source: Mar
ml: മാർച്ച്

source: Apr
ml: ഏപ്രിൽ

source: May
ml: മേയ്

source: Jun
ml: ജൂൺ

source: Profile
ml: പ്രൊഫൈൽ

source: Logout
ml: ലോഗൗട്ട്

# logoutConfirmation
source: Are you sure you want to logout?
ml: നിങ്ങൾ യാഥാർത്ഥത്തിൽ ലോഗൗട്ട് ചെയ്യാൻ ആഗ്രഹിക്കുന്നുവോ?

source: Delete Account
ml: അക്കൗണ്ട് മായ്ച്ചു കളയുക

# deleteAccountConfirmation
source: This action cannot be undone. All your data will be permanently deleted.
ml: ഈ പ്രവർത്തനം റദ്ദാക്കാനാകില്ല. നിങ്ങളുടെ എല്ലാ ഡാറ്റയും സ്ഥിരമായി നീക്കം ചെയ്യപ്പെടും.

source: Delete
ml: മായ്ക്കുക

source: User
ml: ഉപയോക്താവ്

source: Travel Statistics
ml: പ്രവാസ സ്ഥിതിവിവരക്കണക്കുകൾ

source: Frequent Mode
ml: സാധാരണ ഗതാഗത മാർഗം

source: Privacy Settings
ml: സ്വകാര്യതാ ക്രമീകരണങ്ങൾ

source: Pause Tracking
ml: ട്രാക്കിംഗ് താൽക്കാലികമായി നിർത്തുക

# pauseTrackingSubtitle
source: Temporarily stop collecting travel data
ml: യാത്രാ ഡാറ്റ ശേഖരണം താൽക്കാലികമായി നിർത്തുക

source: Update Consent
ml: അനുമതി അപ്ഡേറ്റ് ചെയ്യുക

# updateConsentSubtitle
source: Review and update data collection consent
ml: ഡാറ്റാ ശേഖരണാനുമതി പരിശോധിക്കുക

source: Data Collection Consent
ml: ഡാറ്റാ ശേഖരണ അനുമതി

# dataCollectionConsentDescription
source: We collect anonymous travel data to improve urban planning and promote sustainable transportation. Your data is anonymized and secure.
ml: നഗര പദ്ധതിയെ മെച്ചപ്പെടുത്താനും സുസ്ഥിര ഗതാഗതം പ്രോത്സാഹിപ്പിക്കാനും ഞങ്ങൾ അനാമിക യാത്രാ ഡാറ്റ ശേഖരിക്കുന്നു. നിങ്ങളുടെ ഡാറ്റ അാനനിമൈസ് ചെയ്യപ്പെട്ടതും സുരക്ഷിതവുമാണ്.

source: I Understand
ml: എനിക്ക് മനസിലായി

# deleteAccountSubtitle
source: Permanently delete your account and all data
ml: നിങ്ങളുടെ അക്കൗണ്ടും എല്ലാ ഡാറ്റയും സ്ഥിരമായി നീക്കം ചെയ്യുക

source: Open Admin Dashboard
ml: അഡ്മിൻ ഡാഷ്ബോർഡ് തുറക്കുക

source: Trip History
ml: യാത്രാ ചരിത്രം

# noTrips
source: No trips recorded yet
ml: ഇതുവരെ യാത്രകൾ രേഖപ്പെടുത്തിയിട്ടില്ല

# tripsWillAppearHere
source: Your trips will appear here automatically
ml: നിങ്ങളുടെ യാത്രകൾ സ്വയമേവ ഇവിടെ പ്രത്യക്ഷപ്പെടും

source: Trip Details
ml: യാത്ര വിശദാംശങ്ങൾ

source: Start Location
ml: ആരംഭ സ്ഥലം

source: End Location
ml: അവസാന സ്ഥലം

source: Transport Mode
ml: ഗതാഗത മാർഗം

source: Route
ml: റൂട്ട്

source: Ongoing
ml: നടന്ന് വരുന്നു

# transportModeUpdated
source: Transport mode updated to
ml: ഗതാഗത മാർഗം അപ്ഡേറ്റ് ചെയ്‌തു

source: Bicycle
ml: സൈക്കിള്‍

source: Train
ml: ട്രെയിൻ

source: City Center
ml: സിറ്റി സെന്റർ

source: Downtown
ml: ഡൗൺടൗൺ

source: Suburban Area
ml: ഉപനഗര മേഖല

source: Residential Area
ml: റസിഡൻഷ്യൽ മേഖല

source: Record Trip
ml: യാത്ര രേഖപ്പെടുത്തുക

# liveGPSTracking
source: Live GPS Tracking Active
ml: ലൈവ് GPS ട്രാക്കിംഗ് സജീവമാണ്

# simulatingTrip
source: Simulating trip recording...
ml: യാത്ര രേഖപ്പെടുത്തുന്നത് സിമുലേറ്റ് ചെയ്യുന്നു...

source: Start Trip
ml: യാത്ര ആരംഭിക്കുക

source: Stop Trip
ml: യാത്ര നിർത്തുക

# recordingTrip
source: Recording your trip...
ml: നിങ്ങളുടെ യാത്ര രേഖപ്പെടുത്തുന്നു...
